app/Http/Controllers/Auth/RegisteredUserController.php

    public function store(Request $request): RedirectResponse
    {
        $request->validate([
            'name' => ['required', 'string', 'max:255'],
            'email' => ['required', 'string', 'lowercase', 'email', 'max:255', 'unique:'.User::class],
            'password' => ['required', 'confirmed', Rules\Password::defaults()],
        ]);

        $user = User::create([
            'name' => $request->name,
            'email' => $request->email,
            'password' => Hash::make($request->password),
        ]);
---
insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('てすと', 'test@test', '$2y$12$CYp5LvGvzJlaMNAZF/MwSO3m7D31rZk5XGl.qUrUMZPYNijjMDJgW', '2025-01-31 00:47:29', '2025-01-31 00:47:29')