app/Http/Controllers/IncomingShipmentController.php

select * from `incoming_shipments` where `incoming_shipments`.`deleted_at` is null
---
    public function index()
    {
        $incomingShipments = IncomingShipment::all();

select * from `inventories` where `inventories`.`deleted_at` is null
---
    public function create(Request $request)
    {
        $inventories = Inventory::all();

select * from `inventories` where `inventories`.`id` = '6' and `inventories`.`deleted_at` is null limit 1
insert into `incoming_shipments` (`inventory_id`, `user_id`, `quantity`, `supplier_name`, `received_date`, `status`, `updated_at`, `created_at`) values ('6', 1, '1', 'ネクストレボリューション', '2025-02-01 23:21:40', 'completed', '2025-02-01 23:21:40', '2025-02-01 23:21:40')
---
    public function store(Request $request)
    {
        $request->validate([
            'inventory_id' => ['required', 'exists:inventories,id'],
            'quantity' => ['required', 'integer', 'min:1'],
            'supplier_name' => ['required', 'string', 'max:255'],
        ], [
            'inventory_id.required' => '商品を選択してください。',
            'inventory_id.exists' => '選択された商品は存在しません。',
            'quantity.required' => '入庫数量を入力してください。',
            'quantity.integer' => '入庫数量は整数で入力してください。',
            'quantity.min' => '入庫数量は1以上で入力してください。',
            'supplier_name.required' => '仕入先を入力してください。',
        ]);

        try {
            DB::beginTransaction();

            $inventory = Inventory::findOrFail($request->inventory_id);
            $totalQuantity = $request->quantity * $inventory->package_quantity;

            // 入庫情報を記録
            $incomingShipment = new IncomingShipment();
            $incomingShipment->inventory_id = $request->inventory_id;
            $incomingShipment->user_id = Auth::id();
            $incomingShipment->quantity = $request->quantity;
            $incomingShipment->supplier_name = $request->supplier_name;
            $incomingShipment->received_date = now();
            $incomingShipment->status = 'completed';
            $incomingShipment->save();

select * from `incoming_shipments` where `incoming_shipments`.`id` = '12' and `incoming_shipments`.`deleted_at` is null limit 1
select * from `inventories` where `inventories`.`deleted_at` is null
---
    public function edit(string $id)
    {
        $incomingShipment = IncomingShipment::findOrFail($id);
        $inventories = Inventory::all(); // 在庫の一覧を取得