app/Http/Controllers/IncomingShipmentController.php

insert into `incoming_shipments` (`inventory_id`, `user_id`, `quantity`, `unit`, `received_date`, `status`, `updated_at`, `created_at`) values ('2', 1, '4', 'パッケージ', '2025-01-31 10:18:07', 'completed', '2025-01-31 10:18:07', '2025-01-31 10:18:07')
---
    public function store(Request $request)
    {
        $request->validate([
            'inventory_id' => ['required', 'exists:inventories,id'],
            'quantity' => ['required', 'integer', 'min:1'],
        ], [
            'inventory_id.required' => '商品を選択してください。',
            'inventory_id.exists' => '選択された商品は存在しません。',
            'quantity.required' => '入庫数量を入力してください。',
            'quantity.integer' => '入庫数量は整数で入力してください。',
            'quantity.min' => '入庫数量は1以上で入力してください。',
        ]);

        $inventory = Inventory::findOrFail($request->inventory_id);

        // パッケージ数量を考慮した実際の入庫数を計算
        $actualQuantity = $request->quantity * $inventory->package_quantity;

        // 入庫情報を記録
        $incomingShipment = new IncomingShipment();
        $incomingShipment->inventory_id = $request->inventory_id;
        $incomingShipment->user_id = Auth::id();
        $incomingShipment->quantity = $request->quantity;
        $incomingShipment->unit = $inventory->package_quantity > 1 ? 'パッケージ' : '個';
        $incomingShipment->received_date = now();
        $incomingShipment->status = 'completed';
        $incomingShipment->save();