app/Http/Controllers/InventoryController.php

    public function show(string $id)
    {
        $inventory = Inventory::find($id);
---
select * from `inventories` where `inventories`.`id` = '1' and `inventories`.`deleted_at` is null limit 1