app/Http/Controllers/InventoryController.php

select * from `inventories` where `inventories`.`deleted_at` is null
---
    public function index()
    {
        $inventories = Inventory::all();

select * from `inventories` where `inventories`.`id` = '1' and `inventories`.`deleted_at` is null limit 1
---
    public function edit(string $id)
    {
        $inventory = Inventory::find($id);

select * from `inventories` where `inventories`.`id` = '2' and `inventories`.`deleted_at` is null limit 1
---
    public function update(Request $request, string $id)
    {
        $inventory = Inventory::find($id);