app/Http/Controllers/OutgoingShipmentController.php


        // 在庫数を更新
        $inventory->current_stock -= $request->quantity;
        $inventory->save();
---
update `inventories` set `current_stock` = 0, `inventories`.`updated_at` = '2025-01-31 11:28:55' where `id` = 2