app/Http/Controllers/OutgoingShipmentController.php

    public function create(Request $request)
    {
        $inventories = Inventory::all();
---
select * from `inventories` where `inventories`.`deleted_at` is null

    public function store(Request $request)
    {
        $request->validate([
            'inventory_id' => ['required', 'exists:inventories,id'],
            'quantity' => ['required', 'integer', 'min:1'],
            'customer_name' => ['required', 'string', 'max:255'],
        ], [
            'inventory_id.required' => '商品を選択してください。',
            'inventory_id.exists' => '選択された商品は存在しません。',
            'quantity.required' => '出庫数量を入力してください。',
            'quantity.integer' => '出庫数量は整数で入力してください。',
            'quantity.min' => '出庫数量は1以上で入力してください。',
            'customer_name.required' => '顧客名を入力してください。',
            'customer_name.max' => '顧客名は255文字以内で入力してください。',
        ]);

        try {
            DB::beginTransaction();

            $inventory = Inventory::findOrFail($request->inventory_id);
---
select * from `inventories` where `inventories`.`id` = '2' and `inventories`.`deleted_at` is null limit 1

            $outgoingShipment->customer_name = $request->customer_name;
            $outgoingShipment->shipped_date = now();
            $outgoingShipment->status = 'completed';
            $outgoingShipment->save();
---
insert into `outgoing_shipments` (`inventory_id`, `user_id`, `quantity`, `shipped_date`, `status`, `updated_at`, `created_at`) values ('2', 1, '9', '2025-01-31 11:28:55', 'completed', '2025-01-31 11:28:55', '2025-01-31 11:28:55')

    public function edit(string $id)
    {
        $outgoingShipment = OutgoingShipment::findOrFail($id);
        $inventories = Inventory::all();
---
select * from `outgoing_shipments` where `outgoing_shipments`.`id` = '3' and `outgoing_shipments`.`deleted_at` is null limit 1
select * from `inventories` where `inventories`.`deleted_at` is null