app/Http/Controllers/StockManagementController.php

select * from `inventories` where `inventories`.`deleted_at` is null
---
    public function index()
    {
        $inventories = Inventory::all();