app/Http/Controllers/StockHistoryController.php

select * from `inventories` where `inventories`.`id` in (1) and `inventories`.`deleted_at` is null
select * from `stock_histories` where `inventory_id` = '1' and `movement_type` = 'outgoing' and `stock_histories`.`deleted_at` is null order by `record_date` desc limit 20 offset 0
select * from `users` where `users`.`id` in (1)
select count(*) as aggregate from `stock_histories` where `inventory_id` = '1' and `movement_type` = 'outgoing' and `stock_histories`.`deleted_at` is null
select * from `inventories` where `inventories`.`deleted_at` is null order by `item_name` asc
---
    public function index(Request $request)
    {
        $query = StockHistory::with(['inventory', 'user', 'reference']);

        // 商品でフィルター
        if ($request->filled('inventory_id')) {
            $query->where('inventory_id', $request->inventory_id);
        }

        // 変動タイプでフィルター
        if ($request->filled('movement_type')) {
            $query->where('movement_type', $request->movement_type);
        }

        // 日付範囲でフィルター
        if ($request->filled('date_from')) {
            $query->whereDate('record_date', '>=', $request->date_from);
        }
        if ($request->filled('date_to')) {
            $query->whereDate('record_date', '<=', $request->date_to);
        }

        $stockHistories = $query->latest('record_date')->paginate(20);
        $inventories = Inventory::orderBy('item_name')->get();