app/Models/Inventory.php

update `inventories` set `current_stock` = 80, `inventories`.`updated_at` = '2025-01-31 10:18:07' where `id` = 2
insert into `stock_histories` (`stock_quantity`, `record_date`, `movement_type`, `reference_id`, `reference_type`, `inventory_id`, `updated_at`, `created_at`) values (80, '2025-01-31 00:00:00', 'incoming', 1, 'App\\Models\\IncomingShipment', 2, '2025-01-31 10:18:07', '2025-01-31 10:18:07')
---
    public function updateStock($quantity, $type, $referenceModel = null)
    {
        if ($type === 'incoming') {
            $this->current_stock += $quantity;
        } elseif ($type === 'outgoing') {
            $this->current_stock -= $quantity;
        }
        $this->save();

        // 在庫履歴を記録
        $this->stockHistories()->create([
            'stock_quantity' => $this->current_stock,
            'record_date' => now()->toDateString(),
            'movement_type' => $type,
            'reference_id' => $referenceModel ? $referenceModel->id : null,
            'reference_type' => $referenceModel ? get_class($referenceModel) : null,
        ]);